balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA308.PIC
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------xxxxxxxxxx" edc:name="PORTE" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE8" edc:desc="" edc:mask="0x1" edc:name="RE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE9" edc:desc="" edc:mask="0x1" edc:name="RE9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="LATE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------xxxxxxxxxx" edc:name="LATE" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE2" edc:desc="" edc:mask="0x1" edc:name="LATE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE3" edc:desc="" edc:mask="0x1" edc:name="LATE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE4" edc:desc="" edc:mask="0x1" edc:name="LATE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE5" edc:desc="" edc:mask="0x1" edc:name="LATE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE6" edc:desc="" edc:mask="0x1" edc:name="LATE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATE7" edc:desc="" edc:mask="0x1" edc:name="LATE7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE8" edc:desc="" edc:mask="0x1" edc:name="LATE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE9" edc:desc="" edc:mask="0x1" edc:name="LATE9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="ODCE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="ODCE" edc:nzwidth="0x10" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODE0" edc:desc="" edc:mask="0x1" edc:name="ODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE1" edc:desc="" edc:mask="0x1" edc:name="ODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE2" edc:desc="" edc:mask="0x1" edc:name="ODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE3" edc:desc="" edc:mask="0x1" edc:name="ODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE4" edc:desc="" edc:mask="0x1" edc:name="ODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE5" edc:desc="" edc:mask="0x1" edc:name="ODE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE6" edc:desc="" edc:mask="0x1" edc:name="ODE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODE7" edc:desc="" edc:mask="0x1" edc:name="ODE7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE8" edc:desc="" edc:mask="0x1" edc:name="ODE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODE9" edc:desc="" edc:mask="0x1" edc:name="ODE9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-----nnnnnnn" edc:cname="TRISF" edc:desc="" edc:impl="0xfe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-----1111111" edc:name="TRISF" edc:nzwidth="0x10" edc:por="--11-----1111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISF12" edc:desc="" edc:mask="0x1" edc:name="TRISF12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF13" edc:desc="" edc:mask="0x1" edc:name="TRISF13" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
