balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA308.PIC
        <edc:SFRDef edc:access="-------------n-n" edc:cname="LCDDATA19" edc:desc="" edc:impl="0x5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------u-u" edc:name="LCDDATA19" edc:nzwidth="16" edc:por="-------------0-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C4" edc:desc="" edc:mask="0x1" edc:name="S48C4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="S50C4" edc:desc="" edc:mask="0x1" edc:name="S50C4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA20" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA20" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C5" edc:desc="" edc:mask="0x1" edc:name="S00C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C5" edc:desc="" edc:mask="0x1" edc:name="S01C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C5" edc:desc="" edc:mask="0x1" edc:name="S02C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C5" edc:desc="" edc:mask="0x1" edc:name="S03C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C5" edc:desc="" edc:mask="0x1" edc:name="S04C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C5" edc:desc="" edc:mask="0x1" edc:name="S05C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C5" edc:desc="" edc:mask="0x1" edc:name="S06C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C5" edc:desc="" edc:mask="0x1" edc:name="S07C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C5" edc:desc="" edc:mask="0x1" edc:name="S08C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C5" edc:desc="" edc:mask="0x1" edc:name="S09C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C5" edc:desc="" edc:mask="0x1" edc:name="S10C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C5" edc:desc="" edc:mask="0x1" edc:name="S11C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C5" edc:desc="" edc:mask="0x1" edc:name="S12C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C5" edc:desc="" edc:mask="0x1" edc:name="S13C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C5" edc:desc="" edc:mask="0x1" edc:name="S14C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C5" edc:desc="" edc:mask="0x1" edc:name="S15C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA21" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA21" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C5" edc:desc="" edc:mask="0x1" edc:name="S16C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C5" edc:desc="" edc:mask="0x1" edc:name="S17C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C5" edc:desc="" edc:mask="0x1" edc:name="S18C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C5" edc:desc="" edc:mask="0x1" edc:name="S19C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C5" edc:desc="" edc:mask="0x1" edc:name="S20C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C5" edc:desc="" edc:mask="0x1" edc:name="S21C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C5" edc:desc="" edc:mask="0x1" edc:name="S22C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C5" edc:desc="" edc:mask="0x1" edc:name="S23C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C5" edc:desc="" edc:mask="0x1" edc:name="S24C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C5" edc:desc="" edc:mask="0x1" edc:name="S25C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C5" edc:desc="" edc:mask="0x1" edc:name="S26C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C5" edc:desc="" edc:mask="0x1" edc:name="S27C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C5" edc:desc="" edc:mask="0x1" edc:name="S28C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C5" edc:desc="" edc:mask="0x1" edc:name="S29C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C5" edc:desc="" edc:mask="0x1" edc:name="S30C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C5" edc:desc="" edc:mask="0x1" edc:name="S31C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA22" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA22" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C5" edc:desc="" edc:mask="0x1" edc:name="S32C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C5" edc:desc="" edc:mask="0x1" edc:name="S33C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C5" edc:desc="" edc:mask="0x1" edc:name="S34C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C5" edc:desc="" edc:mask="0x1" edc:name="S35C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C5" edc:desc="" edc:mask="0x1" edc:name="S36C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C5" edc:desc="" edc:mask="0x1" edc:name="S37C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C5" edc:desc="" edc:mask="0x1" edc:name="S38C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C5" edc:desc="" edc:mask="0x1" edc:name="S39C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C5" edc:desc="" edc:mask="0x1" edc:name="S40C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C5" edc:desc="" edc:mask="0x1" edc:name="S41C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C5" edc:desc="" edc:mask="0x1" edc:name="S42C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C5" edc:desc="" edc:mask="0x1" edc:name="S43C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C5" edc:desc="" edc:mask="0x1" edc:name="S44C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C5" edc:desc="" edc:mask="0x1" edc:name="S45C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C5" edc:desc="" edc:mask="0x1" edc:name="S46C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C5" edc:desc="" edc:mask="0x1" edc:name="S47C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------------n-n" edc:cname="LCDDATA23" edc:desc="" edc:impl="0x5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------u-u" edc:name="LCDDATA23" edc:nzwidth="16" edc:por="-------------0-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C5" edc:desc="" edc:mask="0x1" edc:name="S48C5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="S50C5" edc:desc="" edc:mask="0x1" edc:name="S50C5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA24" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA24" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C6" edc:desc="" edc:mask="0x1" edc:name="S00C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C6" edc:desc="" edc:mask="0x1" edc:name="S01C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C6" edc:desc="" edc:mask="0x1" edc:name="S02C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C6" edc:desc="" edc:mask="0x1" edc:name="S03C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C6" edc:desc="" edc:mask="0x1" edc:name="S04C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C6" edc:desc="" edc:mask="0x1" edc:name="S05C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C6" edc:desc="" edc:mask="0x1" edc:name="S06C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C6" edc:desc="" edc:mask="0x1" edc:name="S07C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C6" edc:desc="" edc:mask="0x1" edc:name="S08C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C6" edc:desc="" edc:mask="0x1" edc:name="S09C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C6" edc:desc="" edc:mask="0x1" edc:name="S10C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C6" edc:desc="" edc:mask="0x1" edc:name="S11C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C6" edc:desc="" edc:mask="0x1" edc:name="S12C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C6" edc:desc="" edc:mask="0x1" edc:name="S13C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C6" edc:desc="" edc:mask="0x1" edc:name="S14C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C6" edc:desc="" edc:mask="0x1" edc:name="S15C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
