balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA308.PIC
        <edc:SFRDef edc:access="r-nn----nnnnnnnn" edc:cname="PMCON2" edc:desc="" edc:impl="0xf0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----00000000" edc:name="PMCON2" edc:nzwidth="0x10" edc:por="0-00----00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RADDR" edc:desc="" edc:mask="0xff" edc:name="RADDR" edc:nzwidth="8"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="" edc:mask="0x1" edc:name="TIMEOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RADDR16" edc:desc="" edc:mask="0x1" edc:name="RADDR16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR17" edc:desc="" edc:mask="0x1" edc:name="RADDR17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR18" edc:desc="" edc:mask="0x1" edc:name="RADDR18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR19" edc:desc="" edc:mask="0x1" edc:name="RADDR19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR20" edc:desc="" edc:mask="0x1" edc:name="RADDR20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR21" edc:desc="" edc:mask="0x1" edc:name="RADDR21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR22" edc:desc="" edc:mask="0x1" edc:name="RADDR22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR23" edc:desc="" edc:mask="0x1" edc:name="RADDR23" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn-nnnnnnn" edc:cname="PMCON3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000-0000000" edc:name="PMCON3" edc:nzwidth="0x10" edc:por="0000-000-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTEN16" edc:desc="" edc:mask="0x1" edc:name="PTEN16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN17" edc:desc="" edc:mask="0x1" edc:name="PTEN17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN18" edc:desc="" edc:mask="0x1" edc:name="PTEN18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN19" edc:desc="" edc:mask="0x1" edc:name="PTEN19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN20" edc:desc="" edc:mask="0x1" edc:name="PTEN20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN21" edc:desc="" edc:mask="0x1" edc:name="PTEN21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN22" edc:desc="" edc:mask="0x1" edc:name="PTEN22" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AWAITE" edc:desc="" edc:mask="0x1" edc:name="AWAITE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AWAITM" edc:desc="" edc:mask="0x3" edc:name="AWAITM" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTBE0EN" edc:desc="" edc:mask="0x1" edc:name="PTBE0EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTBE1EN" edc:desc="" edc:mask="0x1" edc:name="PTBE1EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTRDEN" edc:desc="" edc:mask="0x1" edc:name="PTRDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTWREN" edc:desc="" edc:mask="0x1" edc:name="PTWREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="AWAITM0" edc:desc="" edc:mask="0x1" edc:name="AWAITM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AWAITM1" edc:desc="" edc:mask="0x1" edc:name="AWAITM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMCON4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PMCON4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTEN0" edc:desc="" edc:mask="0x1" edc:name="PTEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN1" edc:desc="" edc:mask="0x1" edc:name="PTEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN2" edc:desc="" edc:mask="0x1" edc:name="PTEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN3" edc:desc="" edc:mask="0x1" edc:name="PTEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN4" edc:desc="" edc:mask="0x1" edc:name="PTEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN5" edc:desc="" edc:mask="0x1" edc:name="PTEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN6" edc:desc="" edc:mask="0x1" edc:name="PTEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN7" edc:desc="" edc:mask="0x1" edc:name="PTEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN8" edc:desc="" edc:mask="0x1" edc:name="PTEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN9" edc:desc="" edc:mask="0x1" edc:name="PTEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN10" edc:desc="" edc:mask="0x1" edc:name="PTEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN11" edc:desc="" edc:mask="0x1" edc:name="PTEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN12" edc:desc="" edc:mask="0x1" edc:name="PTEN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN13" edc:desc="" edc:mask="0x1" edc:name="PTEN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN14" edc:desc="" edc:mask="0x1" edc:name="PTEN14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN15" edc:desc="" edc:mask="0x1" edc:name="PTEN15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnnnnn-----" edc:cname="PMCS1CF" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000000-----" edc:name="PMCS1CF" edc:nzwidth="16" edc:por="0000-000000-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTSZ" edc:desc="" edc:mask="0x3" edc:name="PTSZ" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ACKP" edc:desc="" edc:mask="0x1" edc:name="ACKP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SM" edc:desc="" edc:mask="0x1" edc:name="SM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDSP" edc:desc="" edc:mask="0x1" edc:name="RDSP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRSP" edc:desc="" edc:mask="0x1" edc:name="WRSP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BEP" edc:desc="" edc:mask="0x1" edc:name="BEP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSPTEN" edc:desc="" edc:mask="0x1" edc:name="CSPTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSP" edc:desc="" edc:mask="0x1" edc:name="CSP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSDIS" edc:desc="" edc:mask="0x1" edc:name="CSDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PTSZ0" edc:desc="" edc:mask="0x1" edc:name="PTSZ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTSZ1" edc:desc="" edc:mask="0x1" edc:name="PTSZ1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnn---n---" edc:cname="PMCS1BS" edc:desc="" edc:impl="0x88" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---0---" edc:name="PMCS1BS" edc:nzwidth="16" edc:por="000000000---0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BASE11" edc:desc="" edc:mask="0x1" edc:name="BASE11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="BASE15" edc:desc="" edc:mask="0x1" edc:name="BASE15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE16" edc:desc="" edc:mask="0x1" edc:name="BASE16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE17" edc:desc="" edc:mask="0x1" edc:name="BASE17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE18" edc:desc="" edc:mask="0x1" edc:name="BASE18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE19" edc:desc="" edc:mask="0x1" edc:name="BASE19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE20" edc:desc="" edc:mask="0x1" edc:name="BASE20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE21" edc:desc="" edc:mask="0x1" edc:name="BASE21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE22" edc:desc="" edc:mask="0x1" edc:name="BASE22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BASE23" edc:desc="" edc:mask="0x1" edc:name="BASE23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
